bindParams.yml
config:
  target: "http:/"
  plugins:
    expect: {}
  phases:
    - duration: 500
      arrivalRate: 1
      maxVusers: 1
  defaults:
    headers:
      authorization: "a"
  processor: "functions.js"
  payload:
    - path: "devices.csv"
      fields:
        - "device_id"
      order: sequence
      delimiter: ","
      skipHeader: true
  variables:
    paramKeyIds:
      - [
          "bat-available-percentage",
          "bat-capacity",
          "bat-current-average",
          "bat-current-now",
          "bat-ischarging",
          "cpu-iowait-used",
          "cpu-nice-used",
          "cpu-system-used",
          "cpu-total-used",
          "cpu-user-used",
          "disk-available-bytes",
          "disk-available-percentage",
          "disk-usage-bytes",
          "disk-usage-percentage",
          "heart-hate-status",
          "ram-app-used-bytes",
          "ram-used-bytes",
          "screen-brightness-percentage",
          "time-drift",
          "wifi-level",
        ]
      #Tizen params - [ 'bat-available-percentage', 'bat-capacity', 'bat-current-average', 'bat-current-now', 'bat-ischarging', 'cpu-iowait-used', 'cpu-nice-used', 'cpu-system-used', 'cpu-total-used', 'cpu-user-used', 'disk-available-bytes', 'disk-available-percentage', 'disk-usage-percentage',  'ram-used-bytes', 'screen-brightness-percentage', 'time-drift', 'wifi-level' ]
      #Polar params - [ 'bat-available-percentage', 'disk-usage-percentage',  'heart-hate-status', 'time-drift' ]
scenarios:
  - name: "Create a bind of params to a deviceId : {{ device_id  }}"
    flow:
      - log: "POST Login"
      - post:
          url: "/pm-user-management:3000/api/v1/auth/login"
          json:
            username: "adriana"
            password: "123456"
          capture:
            - json: "$.token.access_token"
              as: "auth_token"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: token

      - loop:
          - log: "POST bind deviceId: {{ device_id }} with paramsKeyId: {{ $loopElement }}"
          - post:
              url: "/system-management:8080/sm/api/v1/device-management/bind/rules"
              headers:
                authorization: "Bearer {{ auth_token }}"
              json:
                device_id: "{{ device_id }}"
                param_key_id: "{{ $loopElement }}"
                read_frequency: 15
              expect:
                - statusCode: 201
                - contentType: json
        over: paramKeyIds